Delsian/nrf52l/src/pca9685.c
/*
 * pca9685.c
 *
 *  Created on: Jan 13, 2018
 *      Author: Eug
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include "pca9685.h"
#include "boards.h"
#include "nrf.h"
#include "app_error.h"
#include "sdk_errors.h"
#include "nrf_delay.h"
#include "nrf_drv_twi.h"
#include "app_util_platform.h"

#define PCA9685_ADDR 0x60
#define PCA9685_MAX_CHANNEL         15

#define PCA9685_LEDR				0
#define PCA9685_LEDG				1
#define PCA9685_LEDB				15

// Register addresses from data sheet
#define PCA9685_MODE1_REG           0x00
#define PCA9685_MODE2_REG           0x01
#define PCA9685_SUBADR1_REG         0x02
#define PCA9685_SUBADR2_REG         0x03
#define PCA9685_SUBADR3_REG         0x04
#define PCA9685_ALLCALL_REG         0x05
#define PCA9685_LED0_REG            0x06 // Start of LEDx regs, 4B per reg, 2B on phase, 2B off phase, little-endian
#define PCA9685_PRESCALE_REG        0xFE
#define PCA9685_ALLLED_REG          0xFA

// Mode1 register pin layout
#define PCA9685_MODE_RESTART        0x80
#define PCA9685_MODE_EXTCLK         0x40
#define PCA9685_MODE_AUTOINC        0x20
#define PCA9685_MODE_SLEEP          0x10
#define PCA9685_MODE_SUBADR1        0x08
#define PCA9685_MODE_SUBADR2        0x04
#define PCA9685_MODE_SUBADR3        0x02
#define PCA9685_MODE_ALLCALL        0x01

#define PCA9685_SW_RESET            0x06 // Sent to address 0x00 to reset all devices on Wire line
#define PCA9685_PWM_FULL            0x01000 // Special value for full on/full off LEDx modes

const nrf_drv_twi_config_t tPcaConfig = {
	.scl                = TWI0_SCL,
	.sda                = TWI0_SDA,
	.frequency          = NRF_TWI_FREQ_100K,
	.interrupt_priority = APP_IRQ_PRIORITY_LOWEST,
	.clear_bus_init     = false
};

static const nrf_drv_twi_t tPcaDrv = NRF_DRV_TWI_INSTANCE(0);

// write 2 byte value using auto-increment
void PcaWriteChannel(uint8_t ch, uint16_t val_on, uint16_t val_off)
{
	static uint8_t ubData[5];

	if (ch<=PCA9685_MAX_CHANNEL || ch == PCA9685_ALLLED_REG) {
		ubData[0] = (ch == PCA9685_ALLLED_REG)? ch : ((ch<<2) + PCA9685_LED0_REG);
		ubData[1] = val_on&0xFF;
		ubData[2] = val_on>>8;
		//ubData[3] = val_off&0xFF;
		//ubData[4] = val_off>>8;
		nrf_drv_twi_tx(&tPcaDrv, PCA9685_ADDR, ubData, 3, false);
	}
}

void PcaInit(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_twi_init(&tPcaDrv, &tPcaConfig, NULL, NULL);
    APP_ERROR_CHECK(err_code);
    nrf_drv_twi_enable(&tPcaDrv);

	const uint8_t ubDataSet[2][2] = {
			{PCA9685_MODE1_REG, 0}, //PCA9685_MODE_SLEEP},
			//{PCA9685_PRESCALE_REG, 3}, // max pwm freq
			//{PCA9685_MODE1_REG, PCA9685_MODE_RESTART},
			{PCA9685_MODE2_REG, 0x4}
	};
	for (int i=0; i<2;i++) {
		nrf_drv_twi_tx(&tPcaDrv, PCA9685_ADDR, ubDataSet[i], 2, false);
	}


	for (int i=0; i<16; i++)
	{
		PcaWriteChannel(i,(i+1)*16, 0x80);
	}

}
